{
  "about": {
    "who": "I currently live in Riverside, California. I'm a UX/UI designer and a Software Engineer. I consider myself a versatile and capable person who enjoys helping people. My goal is find an organization for which I can make great contributions.",
    "experience": "My experiences consist of working for local start-ups, building web and mobile applications for clients, designing software, designing user interfaces and experiences, project and group management, and game development.",
    "education": "B.S. in Informatics with a specialization in Human-Computer Interaction at the University of California, Irvine. (Grad 2020 GPA 3.7)",
    "skills": {
      "languages": [
        "Python",
        "C++",
        "Javascript",
        "TypeScript",
        "Ruby",
        "Java",
        "HTML",
        "CSS"
      ],
      "tools": [
        "Wordpress",
        "Figma",
        "Webflow",
        "Adobe XD",
        "Sketch",
        "Photoshop",
        "Jira",
        "Git",
        "Trello",
        "VSCode",
        "Shopify",
        "Gitlab",
        "Confluence"
      ],
      "methods": [
        "Usability Testing",
        "Cognitive Walkthrough",
        "Heuristic Evaluation",
        "Competitive Analysis",
        "User Intervieww Survey",
        "Prototyping",
        "Wireframing"
      ],
      "frameworks": [
        "Angular.js",
        "Next.js",
        "React.js",
        "Node.js",
        "Express.js",
        "Ruby on Rails",
        "Bootstrap",
        "Ionic 4",
        "Android Studio"
      ]
    }
  },
  "Experience": {
    "Givsum INC": {
      "title": "UX/UI Designer & Frontend Engineer",
      "description": "Givsum is a philanthropic platform for charitable organizations. I was tasked with designing and implementing an analytics dashboard for administrative users. For the design, I worked to create a responsive and accessible design that met company design guidelines and principles. This design was based off of stakeholder analysis and market research using Figma prototyping tool. To implement the design I had to learn a new MVC framework, Ruby on Rails. For the markup language, I learned to use HAML instead of using HTML. I also learned to work with live production data using Google Analytics, and PostgresQL. I used Github for CI/CD, and tracked the project using Trello and Jira. In the end I became proficient in a new set of technologies, and had the dashboard deployed to their production site.",
      "stack": [
        "Ruby on Rails",
        "Javascript",
        "PostgrsQL",
        "HAML",
        "Google Analytics"
      ]
    },
    "Paciolan LLC": {
      "title": "UX/UI Designer & Frontend Engineer",
      "description": "Paciolan is a white label ticketing platform for sports and other events. As a proof of concept, I was tasked with improving the SEO and Google ranking for the landing pages of their Football teams. I iterated through and improved different designs while doing market research and enhancing SEO attributes of the site. I learned many details that Google’s crawler looks at when determining a ranking such as structured data, page layout and content, dynamic meta tags, and the Open Graph Protocol. In order to implement the design, I learned a new React.js framework, Next.js. This framework’s server-side rendering is an aspect that enhances SEO as it renders static HTML pages that are crawler friendly. I experienced a professional CI/CD pipeline using GitLab, and tracked the project's progress using Jira and Confluence. In the end, we saw promising improvements in SEO, Performance, and Accessibility scores.",
      "stack": ["Javascript", "React.js", "Next.js"]
    },
    "DreamWare LLC": {
      "title": "Freelancer",
      "description": "Dreamware is a freelancing software and design company that I founded while in college. I have worked with a variety of businesses to enhance their online presence. This includes working with clients in developing solutions for clothing stores, rental companies, restaurants and software services. To meet the needs of these businesses, I provide rapid prototyping based on UI/UX research like surveys, competitive analysis, among others. To implement these designs, I've worked with different technologies like Wordpress, WebFlow, Shopify, Angular.js, React.js among others. ",
      "stack": ["Javascript", "React.js", "Next.js"]
    }
  },
  "Projects": {
    "Twitter Correct": {
      "title": "Personal Project",
      "description": "Twitter Correct is a service that allows users to search their tweets for sensitive terminology. Users are able to sign in through Twitter and grant access to the application. The last 5500 tweets of the user are searched against a blacklist of words and phrases consisting of default and user-entered words and phrases. These tweets are displayed and can then be automatically or manually deleted by the user. Since this was a personal project, I was able to experiment with my approach to this problem.This web application was built using the MERN stack. Users would be able to sign in through twitter using the Twitter OAuth API. User tweets are pulled using the Twitter API.",
      "stack": ["MongoDB", "Express.js", "React.js", "Node.js"]
    },
    "Spotify Clone": {
      "title": "Personal Project",
      "description": "For this project, I wanted to build a web application using the Spotify Endpoint API. Users would be able to sign in using Spotify OAuth, giving the application authorization tokens for accessing their information. The things users are able to do resemble Spotify, such as loading their personal information and playlist, but also being able to browse through their services. Since this was a personal project, I had full discretion over how I wanted to implement this application. For the frontend implementation, I decided to use Angular as a framework. Within Angular, I used Typescript over Javascript for maximum efficiency. Bootstrap was also used to implement aspects of the front end application. For the backend, I used both NodeJS and its framework ExpressJs. I implemented authorization and authentication using Spotify OAuth, set-up API endpoint call architecture.",
      "stack": [
        "MongoDB",
        "Express.js",
        "Angular.js",
        "Node.js",
        "Typescript",
        "Bootstrap"
      ]
    },
    "Fry's Electronics": {
      "title": "Group Project - UX/UI Redesign",
      "description": "In this report we present the process and findings in the Fry’s website redesign. Fry's website was chosen as we saw there was a need for improvement across the platform. Our goals were to use different methodologies to gain an understanding of users, identify issues within the site, and evaluate this data to use for the redesign. We also wanted to create iterations of sketches, wire frames, and mock ups, then perform a heuristic evaluation on these to optimize the new interface. With discussion and evaluation, we determined the best approach for this redesign was to use a variety of methodologies. Our initial method was to perform competitive analysis on similar platforms as a means of gaining an understanding of the landscape. As a means of understanding users and stakeholders we performed user interviews and surveys to gain qualitative data. To identify usability issues on the site, we performed usability tasks/tests, and cognitive walkthroughs. After evaluation of our findings, we determined high, medium, and low priority issues on the site. With this data we were able to materialize a new redesigned interface for the site and its target issues. In addition to this redesign, we performed a heuristic evaluation in which we improve on the redesign. Our initial findings after competitive analysis were that Fry’s website lacked critical features its competitors provided for its users. After analyzing data gained from methods used to understand users and stakeholders, we learned that some users are highly influenced by recommendations, deals, and advertisements, while also having the opposite effect on other users. We also discovered users use a wide range of mediums for which to shop through, yet they prefer to view products on large screens. The methods used to find usability issues on the site yielded issues that a majority of users found relevant. We found users were not able to correctly identify the nearest store location. Users did not have a positive experience when managing and using wish lists. The weekly deals section on the site was cluttered, misleading, and confusing to users. Another usability issue that greatly hindered a positive experience was the lack of a built-in compare tool between products. After evaluation of all this data, we found our target issues were to include the wishlist process, store locator/finder, deals/home page presentation, and the product comparison process and page.",
      "stack": [
        "MongoDB",
        "Express.js",
        "Angular.js",
        "Node.js",
        "Typescript",
        "Bootstrap"
      ]
    },
    "Sleep Tracker": {
      "title": "Group Project - UX/UI Redesign",
      "description": "In this report we present the process and findings in the Fry’s website redesign. Fry's website was chosen as we saw there was a need for improvement across the platform. Our goals were to use different methodologies to gain an understanding of users, identify issues within the site, and evaluate this data to use for the redesign. We also wanted to create iterations of sketches, wire frames, and mock ups, then perform a heuristic evaluation on these to optimize the new interface. With discussion and evaluation, we determined the best approach for this redesign was to use a variety of methodologies. Our initial method was to perform competitive analysis on similar platforms as a means of gaining an understanding of the landscape. As a means of understanding users and stakeholders we performed user interviews and surveys to gain qualitative data. To identify usability issues on the site, we performed usability tasks/tests, and cognitive walkthroughs. After evaluation of our findings, we determined high, medium, and low priority issues on the site. With this data we were able to materialize a new redesigned interface for the site and its target issues. In addition to this redesign, we performed a heuristic evaluation in which we improve on the redesign. Our initial findings after competitive analysis were that Fry’s website lacked critical features its competitors provided for its users. After analyzing data gained from methods used to understand users and stakeholders, we learned that some users are highly influenced by recommendations, deals, and advertisements, while also having the opposite effect on other users. We also discovered users use a wide range of mediums for which to shop through, yet they prefer to view products on large screens. The methods used to find usability issues on the site yielded issues that a majority of users found relevant. We found users were not able to correctly identify the nearest store location. Users did not have a positive experience when managing and using wish lists. The weekly deals section on the site was cluttered, misleading, and confusing to users. Another usability issue that greatly hindered a positive experience was the lack of a built-in compare tool between products. After evaluation of all this data, we found our target issues were to include the wishlist process, store locator/finder, deals/home page presentation, and the product comparison process and page.",
      "stack": [
        "MongoDB",
        "Express.js",
        "Angular.js",
        "Node.js",
        "Typescript",
        "Bootstrap"
      ]
    }
  }
}
